---
kind: method
id: M:Autodesk.Revit.DB.Structure.FabricSheet.IsValidHost(Autodesk.Revit.DB.Element)
source: html/dcb690eb-7514-0371-ddb1-f070aba43a08.htm
---
# Autodesk.Revit.DB.Structure.FabricSheet.IsValidHost Method

Checks whether an element is a valid host for fabric sheet.

## Syntax (C#)
```csharp
public static bool IsValidHost(
	Element host
)
```

## Parameters
- **host** (`Autodesk.Revit.DB.Element`) - The element to check.

## Returns
True if the element is a valid host for fabric sheet, false otherwise.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null